
Функция ПолучитьСписокЭкранов() Экспорт
	
	СписокЭкранов = Новый Массив;
	
	//"menuprofile", "newtrip", "menumessenger", "menumytrip", "menuconfirmation", "menupushnotis", "menuevents"
	СписокЭкранов.Добавить(Новый Структура("Наименование, Тег", "Профайл", "menuprofile"));
	СписокЭкранов.Добавить(Новый Структура("Наименование, Тег", "Новая командировка", "newtrip"));
	СписокЭкранов.Добавить(Новый Структура("Наименование, Тег", "Чат", "menumessenger"));
	СписокЭкранов.Добавить(Новый Структура("Наименование, Тег", "Командировки", "menumytrip"));
	СписокЭкранов.Добавить(Новый Структура("Наименование, Тег", "Авторизации", "menuconfirmation"));
	СписокЭкранов.Добавить(Новый Структура("Наименование, Тег", "Уведомления", "menupushnotis"));
	СписокЭкранов.Добавить(Новый Структура("Наименование, Тег", "События", "menuevents"));
	Возврат СписокЭкранов;
	
КонецФункции