
&НаСервере
Функция ОткрытьРасписаниеНаСервере()
	
	Рас = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресРасписания);
	
	возврат Рас;
КонецФункции

&НаСервере
Процедура СохранитьРасписаниеНаСервере(Рас)
	
	ЭтаФорма.АдресРасписания = ПоместитьВоВременноеХранилище(Рас, ЭтаФорма.УникальныйИдентификатор);	

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияРасписанияРегламентногоЗадания(Рас, Парам) Экспорт
	
	Если Рас <> Неопределено Тогда 
		СохранитьРасписаниеНаСервере(Рас);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРасписание(Команда)
	
	Рас = ОткрытьРасписаниеНаСервере();
	ДР = Новый ДиалогРасписанияРегламентногоЗадания(Рас);
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияРасписанияРегламентногоЗадания", ЭтотОбъект);
	ДР.Показать(Оп);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		ЭтаФорма.Элементы.ФункцияВыполнения.Видимость = Ложь;
	КонецЕсли;
	
	Рас = Новый РасписаниеРегламентногоЗадания;
	ОбъектСервер = РеквизитФормыВЗначение("Объект");	
	Если ОбъектСервер.Расписание.Получить() <> Неопределено Тогда
		Рас = ОбъектСервер.Расписание.Получить();
	КонецЕсли;	
	ЭтаФорма.АдресРасписания = ПоместитьВоВременноеХранилище(Рас, ЭтаФорма.УникальныйИдентификатор);	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Рас = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресРасписания); 
	ТекущийОбъект.Расписание = Новый ХранилищеЗначения(Рас);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры





&НаСервере
Процедура ВыполнитьПринудительноНаСервере()
	УправлениеБТСервер.ФоновоеЗадание(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПринудительно(Команда)
	ВыполнитьПринудительноНаСервере();
КонецПроцедуры
