
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = РегистрыСведений.ОписаниеНоменклатуры.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		НоменклатураБТ = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Наименование = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		ШаблонОписания = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		
		Если НоменклатураБТ = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				Запрос = Новый Запрос; //Да-да запрос в цикле
				Запрос.УстановитьПараметр("Характеристика", ПланыВидовХарактеристик.НаборХарактеристикСистемный[НоменклатураБТ]);
				Запрос.Текст = "ВЫБРАТЬ
				               |	НастройкиСистемы.Характеристика КАК Характеристика,
				               |	НастройкиСистемы.Значение КАК Значение
				               |ИЗ
				               |	РегистрСведений.НастройкиСистемы КАК НастройкиСистемы
				               |ГДЕ
				               |	НастройкиСистемы.Характеристика = &Характеристика";
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Если ЗначениеЗаполнено(Выборка.Значение) Тогда
						МЗ = РегистрыСведений.ОписаниеНоменклатуры.СоздатьМенеджерЗаписи();
						МЗ.Период = НачалоГода(ТекущаяДата());
						МЗ.НоменклатураБТ = Выборка.Значение;
						МЗ.ШаблонОписания = ШаблонОписания;
						МЗ.Записать(Истина);
					КонецЕсли;
				КонецЕсли;
				
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
