&НаКлиенте
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
    Если НЕ Строка = Неопределено Тогда
		Объект.Пароль = УправлениеБТВызовСервера.md5Стандарт(УправлениеБТВызовСервера.MD5ХешСтрока(Строка));
		Объект.Данные = Строка;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПарольНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Подсказка = "Введите пароль";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтаФорма, Новый Структура());
	ПоказатьВводСтроки(Оповещение, Объект.Данные, Подсказка, 0, Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандируемыйПриИзменении(Элемент)
	Если Объект.Наименование = "" Тогда
		Объект.Наименование = Строка(Объект.Командируемый);
	КонецЕсли;
КонецПроцедуры
