

&НаСервере
Функция ЗаполнитьИзИсходногоФайлаНаСервере(ОбъектСсылка, ВариантЗагрузки = Неопределено)
	
	ОбъектСервер = ОбъектСсылка.ПолучитьОбъект();
	Если ЗначениеЗаполнено(ВариантЗагрузки) Тогда
		//Загрузить файл в шину	и прикрепить исходный файл к услуге
		//ОбъектСервер = Документы.Услуга.СоздатьДокумент();
		СтрокаСИД = ОбъектСервер.ОписаниеУслуги.Найти(ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры.IDСинхронизации, "Характеристика");
		Если СтрокаСИД = Неопределено Тогда
			Сообщить("Не нашел Характеристики со значением ""IDСинхронизации""");
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаСИД.Значение) Тогда
			Сообщить("Не заполнена Характеристика ""IDСинхронизации""");			
		Иначе
			IDУслуги = СтрокаСИД.Значение;
			ПолучилиФайл = УправлениеБТВызовСервера.ПолучитьИПрикрепитьИсходныйФайл(ОбъектСервер, ВариантЗагрузки, IDУслуги);
			Если НЕ ПолучилиФайл Тогда
				Сообщить("Произошла ошибка получения файла из шины предприятия");			
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	ЕстьИсходныйФайл = УправлениеБТСервер.ЗагрузкаИзИсходника(ОбъектСервер);
	
	//ЗначениеВРеквизитФормы(ОбъектСервер, "Объект");
	ОбъектСервер.Прочитать();
	Если ОбъектСервер.ПометкаУдаления = Ложь Тогда
		ОбъектСервер.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ОбъектСервер.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Возврат ЕстьИсходныйФайл; 
КонецФункции

&НаСервере
Процедура УстановитьНастройкуЗагрузки(УслугаСсылка, НастройкаСсылка) 
	
	МЗ = РегистрыСведений.РеквизитыУслуги.СоздатьМенеджерЗаписи();
	МЗ.Услуга = УслугаСсылка;
	МЗ.Прочитать();
	МЗ.СозданоСНастройкой = НастройкаСсылка;
	МЗ.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораНастройкиУслуги(ВыбранноеЗначение, П2) Экспорт
	
	Если ВыбранноеЗначение <> ПредопределенноеЗначение("Справочник.НастройкиЗагрузокУслуг.ПустаяСсылка") Тогда
		УстановитьНастройкуЗагрузки(П2, ВыбранноеЗначение);
		ЗаполнитьИзИсходногоФайлаНаСервере(П2, ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		
		Для Каждого ОбъектСсылка ИЗ ПараметрКоманды Цикл
			
			ЕстьИсходныйФайл = ЗаполнитьИзИсходногоФайлаНаСервере(ОбъектСсылка);
			Если НЕ ЕстьИсходныйФайл Тогда
				// Вызов процедуры клиентского модуля
				Параметр = ОбъектСсылка;
				Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораНастройкиУслуги", ЭтотОбъект, Параметр);
				ОткрытьФорму("Справочник.НастройкиЗагрузокУслуг.ФормаВыбора",,,,,,Оп);		
			КонецЕсли;
			
			Оповестить("ИзменениеУслуги", ОбъектСсылка);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
