
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступныеЗначения.Параметры.УстановитьЗначениеПараметра("Ссылка",Запись.НоменклатураБТ);
	
	ДоступныеЭкстраПоля.Параметры.УстановитьЗначениеПараметра("Партнер",Запись.Партнер);
	ДоступныеЭкстраПоля.Параметры.УстановитьЗначениеПараметра("Контрагент",Запись.Контрагент);
	ДоступныеЭкстраПоля.Параметры.УстановитьЗначениеПараметра("Договор",Запись.Договор);
КонецПроцедуры


&НаСервере
Процедура ДоступныеЗначенияВыборНаСервере(Характеристика)
	
	Префикс = "";
	Если ТипЗнч(Характеристика) = Тип("СправочникСсылка.ФункцииОписания") Тогда
		ИмяХарактеристики = Характеристика.КлючПоиска;
		Префикс = "f";
 	ИначеЕсли ТипЗнч(Характеристика) = Тип("ПланВидовХарактеристикСсылка.НаборХарактеристикДляЭкстраПолей") Тогда
		ИмяХарактеристики = Характеристика.КлючПоиска;
	Иначе
		ИмяХарактеристики = Характеристика.КлючПоиска;
	КонецЕсли;
	
	НС = 0;
	НК = 0;
	КС = 0;
	КК = 0;
	Элементы.ШаблонОписания.ПолучитьГраницыВыделения(НС,НК,КС,КК);

	ШаблонОписания = Сред(Запись.ШаблонОписания,0,НК-1) + Префикс+"["+ИмяХарактеристики+"]" + Сред(Запись.ШаблонОписания,КК, СтрДлина(Запись.ШаблонОписания));
	
	Запись.ШаблонОписания = ШаблонОписания;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеЗначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Характеристика = Элемент.ТекущиеДанные.Характеристика;
		ДоступныеЗначенияВыборНаСервере(Характеристика);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеФункцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Характеристика = Элемент.ТекущиеДанные.Ссылка;
		ДоступныеЗначенияВыборНаСервере(Характеристика);
	КонецЕсли;
КонецПроцедуры
