
&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	УправлениеБТСервер.ЗагрузкаИзКаталогов(Объект, Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВсёНаСервере()
	УправлениеБТСервер.ЗагрузкаИзКаталогов(Объект, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсё(Команда)
	ЗагрузитьВсёНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКПапкеПриИзменении(Элемент)
	
	Если НРег(Лев(Объект.ПутьКПапке, 3)) = "ftp" Тогда
		Элементы.ГруппаФТП.Видимость = Истина;
	Иначе
		Элементы.ГруппаФТП.Видимость = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НРег(Лев(Объект.ПутьКПапке, 3)) = "ftp" Тогда
		Элементы.ГруппаФТП.Видимость = Истина;
	Иначе
		Элементы.ГруппаФТП.Видимость = Ложь;		
	КонецЕсли;
КонецПроцедуры
