

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	// Вставить содержимое обработчика.
	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
	
	ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.ПустаяСсылка();
	ПользовательБазы = УправлениеБТВызовСервера.ПользовательИС();
	Если ЗначениеЗаполнено(ПользовательБазы) Тогда
		ПараметрыСеанса.ТекущийПользователь = ПользовательБазы;
	КонецЕсли;
	
	//ПЕРЕНЕСТИ В ДОНОРА
	ПараметрыСеанса.КешСобытийМП = Новый ХранилищеЗначения(МаркетПлейсСервер.УстановитьКЕШСеанса());
КонецПроцедуры
