
&НаСервере
Процедура ДокументыСлеженияИдентификаторМетаданныхПриИзмененииНаСервере(ИдентификаторМетаданных)
	
	//
	СписокПодходящихРеквизитов = Новый Массив();
	
	МетаданныеИдентификатора = Метаданные.НайтиПоПолномуИмени(ИдентификаторМетаданных.ПолноеИмя);
	Для Каждого РеквизитМТ ИЗ МетаданныеИдентификатора.Реквизиты Цикл
		//
		Если РеквизитМТ.Тип.СодержитТип(Тип("ДокументСсылка.Услуга")) Тогда
			СписокПодходящихРеквизитов.Добавить(РеквизитМТ.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТЧ ИЗ МетаданныеИдентификатора.ТабличныеЧасти Цикл
		Для Каждого РеквизитТЧ ИЗ ТЧ.Реквизиты Цикл
			//
			Если РеквизитТЧ.Тип.СодержитТип(Тип("ДокументСсылка.Услуга")) Тогда
				СписокПодходящихРеквизитов.Добавить(ТЧ.Имя+"."+РеквизитТЧ.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Элементы.ДокументыСлеженияРеквизитОбъектаСУслугой.СписокВыбора.ЗагрузитьЗначения(СписокПодходящихРеквизитов);

КонецПроцедуры

&НаКлиенте
Процедура ДокументыСлеженияИдентификаторМетаданныхПриИзменении(Элемент)
	
	Если Элементы.ДокументыСлежения.ТекущиеДанные <> Неопределено Тогда
		ИдентификаторМетаданных = Элементы.ДокументыСлежения.ТекущиеДанные.ИдентификаторМетаданных;
		ДокументыСлеженияИдентификаторМетаданныхПриИзмененииНаСервере(ИдентификаторМетаданных);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументыСлеженияПриАктивизацииСтроки(Элемент)
	

КонецПроцедуры


&НаКлиенте
Процедура ДокументыСлеженияРеквизитОбъектаСУслугойНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элементы.ДокументыСлежения.ТекущиеДанные <> Неопределено Тогда
		ИдентификаторМетаданных = Элементы.ДокументыСлежения.ТекущиеДанные.ИдентификаторМетаданных;
		ДокументыСлеженияИдентификаторМетаданныхПриИзмененииНаСервере(ИдентификаторМетаданных);
	КонецЕсли;
	
КонецПроцедуры

