
&НаСервереБезКонтекста
Процедура УстановитьМодульНаСервере(КлючМодуля)
	МаркетПлейсВызовСервера.УстановитьМодульМаркетплейса(КлючМодуля);
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗакрытияВопросаСкрипта(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.ОК Тогда
		УстановитьМодульНаСервере(Параметры);
    КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьМодуль(Команда)
	
	Если ЭтаФорма.Элементы.СписокМодулей.ТекущиеДанные <> Неопределено Тогда
		ТД = ЭтаФорма.Элементы.СписокМодулей.ТекущиеДанные;
		
		Если ТД.Стоимость > 0 И ТД.Оплачено = Ложь Тогда 
			Режим = РежимДиалогаВопрос.ОКОтмена;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаСкрипта", ЭтаФорма, ТД.КлючМодуля);
			ПоказатьВопрос(Оповещение, "Данная компонента платная, при установке данной компоненты будет списана сумма с баланса компании в размере "+ТД.Стоимость+" рублей"+Символы.ПС+"Вы уверенны, что хотите установить компоненту?", Режим, 0, КодВозвратаДиалога.Отмена, "Установка платной компоненты");
		Иначе
			УстановитьМодульНаСервере(ТД.КлючМодуля);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриОткрытииНаСервере()
	БалансКомпании = МаркетПлейсВызовСервера.ПолучитьБалансКомпании();
	ТДанных = МаркетПлейсВызовСервера.ПолучимМодулиМаркетплейса();
	СписокМодулей.Загрузить(ТДанных);
	
	Результат = МаркетПлейсВызовСервера.СтатусБДВМаркетПлейсВШине();
	ЭтаФорма.Элементы.ФормаДобавитьБазуВМаретПлейс.Видимость   = НЕ Результат;
	ЭтаФорма.Элементы.ФормаУдалитьБазуИзМаркетплейса.Видимость = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ПриОткрытииНаСервере();
КонецПроцедуры




&НаСервере
Процедура ДобавитьБазуВМаретПлейсНаСервере()
	Результат = МаркетПлейсВызовСервера.УстановитьБДВМаркетПлейсВШине();
	Если НЕ Результат.Результат Тогда
		
		ВхОбъект = Результат.ВхОбъект;
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(ВхОбъект);
		СтруктураЖСОН = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Сообщить(СтруктураЖСОН.error);
	Иначе
		ЭтаФорма.Элементы.ФормаДобавитьБазуВМаретПлейс.Видимость   = Ложь;
		ЭтаФорма.Элементы.ФормаУдалитьБазуИзМаркетплейса.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьБазуВМаретПлейс(Команда)
	ДобавитьБазуВМаретПлейсНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьБазуИзМаркетплейсаНаСервере()
	Результат = МаркетПлейсВызовСервера.УдалитьБДВМаркетПлейсВШине();
	Если НЕ Результат.Результат Тогда
		
		ВхОбъект = Результат.ВхОбъект;
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(ВхОбъект);
		СтруктураЖСОН = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		Сообщить(СтруктураЖСОН.error);
	Иначе
		ЭтаФорма.Элементы.ФормаДобавитьБазуВМаретПлейс.Видимость   = Истина;
		ЭтаФорма.Элементы.ФормаУдалитьБазуИзМаркетплейса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьБазуИзМаркетплейса(Команда)
	УдалитьБазуИзМаркетплейсаНаСервере();
КонецПроцедуры





&НаСервере
Функция СписокМодулейВыборНаСервере(ИдентификаторМодуля)
	Описание = МаркетПлейсВызовСервера.ПолучимОписаниеМодуляМаркетплейса(ИдентификаторМодуля);
	Возврат Описание;
КонецФункции

&НаКлиенте
Процедура СписокМодулейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
КонецПроцедуры

&НаКлиенте
Процедура СписокМодулейПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокМодулей.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.СписокМодулей.ТекущиеДанные.Описание = "" Тогда
			Описание = СписокМодулейВыборНаСервере(Элементы.СписокМодулей.ТекущиеДанные.КлючМодуля);
			Элементы.СписокМодулей.ТекущиеДанные.Описание = Описание;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры



&НаСервере
Процедура ОбновитьКомпонентыНаСервере()
	МаркетПлейсВызовСервера.ОбновитьКомпонентыМаркетПлейс();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКомпоненты(Команда)
	ОбновитьКомпонентыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БалансКомпанииНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.ДополнительныйФункционал.Форма.ФормаОтчета");
КонецПроцедуры
