

&НаКлиенте
Процедура Печать(Команда) Экспорт
	
	Для Каждого СтрокаСТабДок ИЗ КомплекДокументов	Цикл		
		ТДАдрес = СтрокаСТабДок.СсылкаНаТабличныйДокумент;
		ТД = ПолучитьИзВременногоХранилища(ТДАдрес);
		ТД.КоличествоЭкземпляров = СтрокаСТабДок.КоличествоКопий;
		ТД.Напечатать(); 
	КонецЦикла;	

КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КоллекцияПечатныхФорм = ЭтаФорма.Параметры.КоллекцияПечатныхФорм;
	
	Для Каждого СтрокаСТабДок ИЗ КоллекцияПечатныхФорм	Цикл
		СтрокаСПечатнойФормой = КомплекДокументов.Добавить();
		СтрокаСПечатнойФормой.Идентификатор = СтрокаСТабДок.ИмяВРЕГ;
		СтрокаСПечатнойФормой.Представление = СтрокаСТабДок.ИмяМакета;
		СтрокаСПечатнойФормой.КоличествоКопий = СтрокаСТабДок.Экземпляров;
		СтрокаСПечатнойФормой.Печатать = Истина;
				
		АдресВХранилище = ПоместитьВоВременноеХранилище(СтрокаСТабДок.ТабличныйДокумент, ЭтаФорма.УникальныйИдентификатор);
		СтрокаСПечатнойФормой.СсылкаНаТабличныйДокумент = АдресВХранилище;		
	КонецЦикла;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомплекДокументовПриАктивизацииСтроки(Элемент)
	
	ТекД = ЭтаФорма.Элементы.КомплекДокументов.ТекущиеДанные;
	Если ТекД <> Неопределено Тогда
		ТДАдрес = ТекД.СсылкаНаТабличныйДокумент;
		ТД = ПолучитьИзВременногоХранилища(ТДАдрес);
		ТабличныйДокумент = ТД;
	КонецЕсли;
	
КонецПроцедуры
