
&НаСервере
Процедура ОтправитьСписокНаСерверНаСервере()
	// Вставить содержимое обработчика.
	ТЗ = РеквизитФормыВЗначение("СписокДступныхПользователей");
	МассивПользователей = УправлениеБТВызовСервера.ТаблицаВМассив(ТЗ);
	МаркетПлейсВызовСервера.УстановитьСписокПользователей(СсылкаНаКомпонент, МассивПользователей); 	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСписокНаСервер(Команда)
	ОтправитьСписокНаСерверНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СсылкаНаКомпонент = ЭтаФорма.Параметры.СсылкаНаКомпонент;
	//Получить список расшаренных пользователей
	ОбновитьСписокНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписокНаСервере()
	// Вставить содержимое обработчика.
	СписокДступныхПользователей.Очистить();
	РезультатСоСписком = МаркетПлейсВызовСервера.ПолучитьСписокПользователей(СсылкаНаКомпонент);
	Если РезультатСоСписком.Результат Тогда	
		Для Каждого ВхСтрока ИЗ РезультатСоСписком.Таблица Цикл
			НоваяСтрока = СписокДступныхПользователей.Добавить();
			НоваяСтрока.ИмяПользователя = ВхСтрока.ИмяПользователя;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Команда)
	ОбновитьСписокНаСервере();
КонецПроцедуры
