
&НаСервереБезКонтекста
Функция ПолучитьУРЛ(Сервер)	
	УРЛ = ?(Сервер.ЗащищенноеСоединение, "https://", "http://")+Сервер.URL; 
	Возврат УРЛ;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанные(Сервер)	
	Логин = Сервер.Логин; 
	Пароль = Сервер.Пароль;
	УРЛСервер = Сервер.URL;
	Порт = ?(Сервер.ЗащищенноеСоединение, 443, 80);
	Возврат Новый Структура("Логин, Пароль, Сервер, Порт", Логин, Пароль, УРЛСервер, Порт);
КонецФункции



&НаКлиенте
Процедура СерверШиныПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.СерверШины) Тогда
		
		УРЛ = ПолучитьУРЛ(Объект.СерверШины); 
		ДДаные = ПолучитьДанные(Объект.СерверШины);
		
		ДДаные = ПолучитьДанные(Объект.СерверШины);		
		РЕСТ = Новый HTTPЗапрос("/sasdrive");
		Соединение = Новый HTTPСоединение(ДДаные.Сервер, ДДаные.Порт, ДДаные.Логин, ДДаные.Пароль,,, ?(ДДаные.Порт = 443, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено) );
		Результат = Соединение.ВызватьHTTPМетод("GET", РЕСТ);
		Cookie = Результат.Заголовки.Получить("Set-Cookie");
		
		PHPSESSID = "";
		Куки = СтрРазделить(Cookie, ";", Истина);
		Для Каждого Кука ИЗ Куки Цикл
			Если СтрНачинаетсяС(Кука, "PHPSESSID") Тогда
				PHPSESSID = Кука;
			КонецЕсли;
		КонецЦикла;
		
		НачатьЗапускПриложения(Новый ОписаниеОповещения("СерверШиныПриИзмененииЗавершение", ЭтотОбъект), УРЛ+"/sasdrive?"+PHPSESSID);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СерверШиныПриИзмененииЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	//
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	
	МакетХТМЛ = ОбъектСервер.ПолучитьМакет("Инструкция");
	HTML = МакетХТМЛ.ПолучитьТекст();
	
КонецПроцедуры
