
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ссылка = ЭтаФорма.Параметры.Заказ;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказИзКорзиныУслуги.НоменклатураБТ КАК Номанклатура,
	               |	ЗаказИзКорзиныУслуги.Описание,
	               |	ЗаказИзКорзиныУслуги.ГУИД
	               |ИЗ
	               |	Документ.ЗаказИзКорзины.Услуги КАК ЗаказИзКорзиныУслуги
	               |ГДЕ
	               |	ЗаказИзКорзиныУслуги.Ссылка = &Ссылка";
	Выгрузка = Запрос.Выполнить().Выгрузить();			   
	СписокУслуг.Загрузить(Выгрузка);			   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Услуга.Ссылка КАК Услуга
	               |ИЗ
	               |	Документ.Услуга КАК Услуга
	               |ГДЕ
	               |	Услуга.ЗаказИзКорзины = &Ссылка";
	Выгрузка = Запрос.Выполнить().Выгрузить();			   
	СписокГотовыхУслуг.Загрузить(Выгрузка);			   
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуУслуги(ВхФорма, ВхПараметры)
	ОбъектУслуги = ДанныеФормыВЗначение(ВхФорма, Тип("ДокументОбъект.Услуга"));
	ОбъектУслуги.Заполнить(ВхПараметры);
	ЗначениеВДанныеФормы(ОбъектУслуги, ВхФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокУслугВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТД = Элемент.ТекущиеДанные;
	ПараметрыФормы = Новый Структура("ЗаказИзКорзины, Номенклатура, ОписаниеКлиента", Ссылка, ТД.Номанклатура, ТД.Описание);
	ФормаУслуги = ПолучитьФорму("Документ.Услуга.ФормаОбъекта", ПараметрыФормы);
	ВхОбъект = ФормаУслуги.Объект;
	ЗаполнитьФормуУслуги(ВхОбъект, ПараметрыФормы);
	ЗаполнитьЗначенияСвойств(ФормаУслуги.Объект, ВхОбъект);
	ФормаУслуги.Открыть();
КонецПроцедуры
