
&НаСервере
Функция ПолучитьКлючЗаписи(Характеристика)

    ЗначениеКлюча = Новый Структура;
    ЗначениеКлюча.Вставить("Характеристика", Характеристика);
	
	ЗначениеПоиска = РегистрыСведений.НастройкиСистемы.Получить(ЗначениеКлюча);
	Если ЗначениеПоиска.Значение = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ЗначениеКлюча);
	Иначе
		ПараметрыОткрытия = Новый Структура("Ключ", РегистрыСведений.НастройкиСистемы.СоздатьКлючЗаписи(ЗначениеКлюча));
	КонецЕсли;	

    Возврат ПараметрыОткрытия;

КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.НастройкиСистемы.ФормаЗаписи", ПолучитьКлючЗаписи(ВыбраннаяСтрока));
		
КонецПроцедуры
