
Функция ПолучитьСписокПечатныхФормКлиента(Контрагент) Экспорт 
	
	Зарпос = Новый Запрос;
	Зарпос.УстановитьПараметр("Партнер", Контрагент.Партнер);
	Зарпос.УстановитьПараметр("Контрагент", Контрагент);
	Зарпос.Текст = "ВЫБРАТЬ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка КАК Ссылка,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИдентификаторНаСтрокуОбъекта КАК ИдентификаторНаСтрокуОбъекта,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.Использовать КАК Использовать,
	               |	ПечатныеФормыКлиентаСписокКоманд.ФорматВывода КАК ФорматВывода,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОбъектМетаданных КАК ОбъектМетаданных,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОтборОбъекта КАК ОтборОбъекта
	               |ПОМЕСТИТЬ ПоУмолчанию
	               |ИЗ
	               |	Справочник.ПечатныеФормыКлиента.СписокКоманд КАК ПечатныеФормыКлиентаСписокКоманд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПечатныеФормыКлиента.СписокОбъектов КАК ПечатныеФормыКлиентаСписокОбъектов
	               |		ПО ПечатныеФормыКлиентаСписокКоманд.Ссылка = ПечатныеФормыКлиентаСписокОбъектов.Ссылка
	               |ГДЕ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	               |	И ПечатныеФормыКлиентаСписокКоманд.Ссылка.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка КАК Ссылка,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИдентификаторНаСтрокуОбъекта КАК ИдентификаторНаСтрокуОбъекта,
	               |	ПечатныеФормыКлиентаСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ПечатныеФормыКлиентаСписокКоманд.Использовать КАК Использовать,
	               |	ПечатныеФормыКлиентаСписокКоманд.ФорматВывода КАК ФорматВывода,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОбъектМетаданных КАК ОбъектМетаданных,
	               |	ПечатныеФормыКлиентаСписокОбъектов.ОтборОбъекта КАК ОтборОбъекта
	               |ПОМЕСТИТЬ ДляКонтрагента
	               |ИЗ
	               |	Справочник.ПечатныеФормыКлиента.СписокКоманд КАК ПечатныеФормыКлиентаСписокКоманд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПечатныеФормыКлиента.СписокОбъектов КАК ПечатныеФормыКлиентаСписокОбъектов
	               |		ПО ПечатныеФормыКлиентаСписокКоманд.Ссылка = ПечатныеФормыКлиентаСписокОбъектов.Ссылка
	               |ГДЕ
	               |	ПечатныеФормыКлиентаСписокКоманд.Ссылка.Партнер = &Партнер
	               |	И ПечатныеФормыКлиентаСписокКоманд.Ссылка.Контрагент = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПоУмолчанию.Ссылка КАК Ссылка,
	               |	ПоУмолчанию.ИдентификаторНаСтрокуОбъекта КАК ИдентификаторНаСтрокуОбъекта,
	               |	ПоУмолчанию.ИмяКоманды КАК ИмяКоманды,
	               |	ПоУмолчанию.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ПоУмолчанию.Использовать КАК Использовать,
	               |	ПоУмолчанию.ФорматВывода КАК ФорматВывода,
	               |	ПоУмолчанию.ОбъектМетаданных КАК ОбъектМетаданных,
	               |	ПоУмолчанию.ОтборОбъекта КАК ОтборОбъекта
	               |ИЗ
	               |	ПоУмолчанию КАК ПоУмолчанию
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ДляКонтрагента.Ссылка,
	               |	ДляКонтрагента.ИдентификаторНаСтрокуОбъекта,
	               |	ДляКонтрагента.ИмяКоманды,
	               |	ДляКонтрагента.ПредставлениеКоманды,
	               |	ДляКонтрагента.Использовать,
	               |	ДляКонтрагента.ФорматВывода,
	               |	ДляКонтрагента.ОбъектМетаданных,
	               |	ДляКонтрагента.ОтборОбъекта
	               |ИЗ
	               |	ДляКонтрагента КАК ДляКонтрагента";
	Выгрузка = Зарпос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
КонецФункции