


Функция ЗагрузитьОбъектВУслугу(Услуга, ВхОбъект, Знач СсылкаНаЗагрузку) Экспорт
	Возврат УправлениеБТВызовСервера.ЗагрузитьДанныеВУслугу(ВхОбъект, Услуга, СсылкаНаЗагрузку);
КонецФункции


Функция ВыполнитьПослеЗакрытияФормыВыбораЗаказаКлиента(ЗаказКлиентаБТ, Пар2) Экспорт
	//
	Если ЗначениеЗаполнено(ЗаказКлиентаБТ) Тогда
		Если ТипЗнч(Пар2) = Тип("ДокументСсылка.Услуга") Тогда
			УправлениеБТВызовСервера.ВключитьУслугуВЗаказКлиента(Пар2, ЗаказКлиентаБТ);	
		ИначеЕсли ТипЗнч(Пар2) = Тип("Массив") Тогда
			Для Каждого Услуга ИЗ Пар2 Цикл
				УправлениеБТВызовСервера.ВключитьУслугуВЗаказКлиента(Услуга, ЗаказКлиентаБТ);	
			КонецЦикла;
		Иначе
			Для Каждого Услуга ИЗ Пар2.ОбъектыОснований Цикл
				УправлениеБТВызовСервера.ВключитьУслугуВЗаказКлиента(Услуга, ЗаказКлиентаБТ);	
			КонецЦикла;
		КонецЕсли;
		
		Сообщить("Услуга включена в документ: "+ЗаказКлиентаБТ );
	Иначе
		Сообщить("Отмена включения в документ Заказ клиента" );		
	КонецЕсли;
	
КонецФункции

Функция ВключитьУслугуВЗаказКлиента(ОписаниеКоманды, ВесьПакет = Ложь) Экспорт
	
	ОООЗ = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВыбораЗаказаКлиента", УправлениеБТКлиент, ОписаниеКоманды);
	ОткрытьФорму("Документ.ЗаказКлиентаБТ.ФормаВыбора",,,,,, ОООЗ)
	
КонецФункции



Функция СоздатьЗаказКлиента(ОписаниеКоманды, ВесьПакет = Ложь) Экспорт
	
	ИсходныйСписокУслуг = ОписаниеКоманды;
	//
	Запланировано = УправлениеБТВызовСервера.ЗапланироватьФормированиеЗаказаКлиентаБТ(ОписаниеКоманды);
	Если ОписаниеКоманды.Количество() > 0  Тогда 		
		ПараметрыОткрытияФормы = Новый Структура;
		ПараметрыОткрытияФормы.Вставить("Основание", ОписаниеКоманды);
		ОткрытьФорму("Документ.ЗаказКлиентаБТ.ФормаОбъекта", ПараметрыОткрытияФормы);	
	КонецЕсли;
	
	Если ТипЗнч(ИсходныйСписокУслуг) = Тип("Массив") Тогда
		Для Каждого УслугаИзМассива ИЗ ИсходныйСписокУслуг Цикл
			Оповестить("ИзменениеУслуги", УслугаИзМассива);
		КонецЦикла;
	Иначе
		Оповестить("ИзменениеУслуги", ИсходныйСписокУслуг);		
	КонецЕсли;

КонецФункции



Функция ОтменитьБронированиеУслуги(ОписаниеКоманды) Экспорт
	ПараметрыФормы = Новый Структура("УслугаПродажи", ОписаниеКоманды);
	ОткрытьФорму("Обработка.БронированиеУслуг.Форма.ФормаОтменыБронирования", ПараметрыФормы);
КонецФункции