
&НаСервере
Функция ПолучитьJSONДерева()
	
	СтароеУсловие = Ложь;
	ОбъектСервер  = РеквизитФормыВЗначение("Объект");	
	Стр = ОбъектСервер.Условие;
	Если НЕ ЗначениеЗаполнено(Стр) Тогда
		Стр = ""; 
	КонецЕсли;
	
	Возврат Стр;
КонецФункции

&НаСервере
Функция УстановитьJSONВДерево(Результат, ТС)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда	
		ОбъектСервер = РеквизитФормыВЗначение("Объект");	
		ОбъектСервер.Условие = Результат.ДеревоПравил; //Новый ХранилищеЗначения(Результат.ДеревоПравил, Новый СжатиеДанных(9));
		ОбъектСервер.ПредставлениеУсловия = Результат.Представление;
		
		ЗначениеВРеквизитФормы(ОбъектСервер, "Объект");
	КонецЕсли;
	
КонецФункции



&НаКлиенте
Процедура ВыполнитьПослеЗакрытияОтбора(Результат, Параметр) Экспорт
	//
	УстановитьJSONВДерево(Результат, Параметр);
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеУсловияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияОтбора", ЭтотОбъект);
	
	Пар = Новый Структура("ДеревоПравил");
	Пар.ДеревоПравил = ПолучитьJSONДерева();
	
	ОткрытьФорму("ОбщаяФорма.ФормаОтбора", Пар,,,,,Оп);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
КонецПроцедуры
