
Функция ПолучитьОрганизациюПоУмолчанию() Экспорт
	
	ОрганизацияСсылка = Справочники.Организации.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Организации.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Организации.Предопределенный,
	               |	Организации.Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОрганизацияСсылка = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ОрганизацияСсылка;	
КонецФункции


Функция ОрганизацияПоУмолчанию() Экспорт
	Возврат ПолучитьОрганизациюПоУмолчанию();	
КонецФункции
