//Здесь перечисляются функции для быстрого доступа из "Внешних функций"

Функция ГлТЕСТ() Экспорт
	Сообщить("тест");
КонецФункции


Функция СформироватьСегменты(Параметры, КодНастройки) Экспорт

	Результат = Неопределено;
	Выполнить (Справочники.ФункцииОписания.СформироватьСегментыV2.КодФункции);
	Возврат Результат;
	
КонецФункции

Функция СформироватьМаршрут(Параметры, ТипЗапроса = 0) Экспорт
	
	Результат = "";
	Выполнить (Справочники.ФункцииОписания.СформироватьМаршрутV2.КодФункции);
	Возврат Результат;
	
КонецФункции

Функция ГородВМесте(Место) Экспорт
	
	Город = "";
	Выполнить (Справочники.ФункцииОписания.ГородВМестеV2.КодФункции);
	Возврат Город;
КонецФункции

Функция СтранаВМесте(Место) Экспорт
	
	Страна = "";
	Выполнить (Справочники.ФункцииОписания.СтранаВМестеV2.КодФункции);
	Возврат Страна;
КонецФункции

//////////////////////////////////////
//
//      		ОБЩЕЕ
//
//////////////////////////////////////

Функция СоздатьЗаказИзКорзиныИЗаказКомандируемого(Параметры, знач НаименованиеИсточника, ПроводитьДокумент = Истина) Экспорт
	
	Результат = Неопределено;
	Выполнить (Справочники.ФункцииОписания.СоздатьЗаказИзКорзиныИЗаказКомандируемогоV2.КодФункции);
	Возврат Результат;
КонецФункции

Функция СоздатьЗаказКомандируемого(Параметры) Экспорт
	
	ТаблицаКомандируемых = Неопределено;
	Выполнить (Справочники.ФункцииОписания.СоздатьЗаказКомандируемогоV2.КодФункции);
	Возврат ТаблицаКомандируемых;//ЗаказКомандированного.Ссылка;
	
КонецФункции

Функция СоздатьЗаказКлиентаБТ(Параметры) Экспорт
	
	ЗаказКомандированного = Документы.ЗаказКомандированногоБТ.ПустаяСсылка();
	Выполнить (Справочники.ФункцииОписания.СоздатьЗаказКлиентаБТV2.КодФункции);
	Возврат ЗаказКомандированного.Ссылка;
КонецФункции

Функция НайтиИлиСоздатьКонтрагента(Описание) Экспорт
	
	КонтрагентСсылка = Справочники.Контрагенты.ПустаяСсылка();
	Выполнить (Справочники.ФункцииОписания.НайтиИлиСоздатьКонтрагентаV2.КодФункции);
	Возврат КонтрагентСсылка;
КонецФункции

Функция ВыполнитьДозагрузку(КодНастройкаЗагрузки, ВхТело) Экспорт
	
	Выполнить (Справочники.ФункцииОписания.ВыполнитьДозагрузкуV2.КодФункции);
		
КонецФункции

Функция УстановитьСтатусУслугиБТ(Услуга, ЗНАЧ СтатусСтрокой, ЗНАЧ Период = Неопределено) Экспорт
	
	Выполнить (Справочники.ФункцииОписания.УстановитьСтатусУслугиБТV2.КодФункции);
  	
КонецФункции




//////////////////////////////////////
//
//      		ВЫГРУЗКА
//
//////////////////////////////////////

Функция ВыполнитьВыгрузкуОбъекта(ВхСсылкаНаНастройку, ВхПараметры) Экспорт
	
	Результат = Новый Массив;
	Выполнить (Справочники.ФункцииОписания.ВыполнитьВыгрузкуОбъектаV2.КодФункции);	
	Возврат Результат;
	
КонецФункции

Функция МассивСтрокВТекст(МассивСтрок) Экспорт
	
	Результат = "";
	Выполнить (Справочники.ФункцииОписания.МассивСтрокВТекстV2.КодФункции);	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьЗапросНаСерверБТ(Сервер, Адрес, ВхТело, ТипЗапроса = "POST") Экспорт
	
	ВхОбъект = "";
	Результат = Ложь;		
	Выполнить (Справочники.ФункцииОписания.ОтправитьЗапросНаСерверБТV2.КодФункции);	
	Возврат Новый Структура("Результат, ВхОбъект", Результат, ВхОбъект); 	
	
КонецФункции	

Функция ХарактеристикаМеста(Место, ТипОписания) Экспорт
	
	Результат = "";		
	Выполнить (Справочники.ФункцииОписания.ХарактеристикаМестаV2.КодФункции);	
	Возврат Результат;
	
КонецФункции




