

&НаСервере
Функция ТекущийПользователь()
	Возврат ПараметрыСеанса.ТекущийПользователь;
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	СистемныйАдминистратор = УправлениеБТВызовСервера.ПолучитьНастройкуСистемы("СистемныйАдминистратор");
	Если СистемныйАдминистратор = ТекущийПользователь() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды)), "Внимание! При данной операции, исходный документ будет изменен, что может привести к частичной или полной потере данных. 
		|Вы уверенны, что хотите продолжить?", Режим, 0);
	Иначе
		Сообщить("У вас недостаточно прав на использование данными возможностями");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;		
	Текст = "";
	Подсказка = "Напишите кратко суть ошибки разработчику";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ОбработкаКомандыЗавершениеЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды, Текст", ПараметрКоманды, Текст)), Текст, Подсказка, 0, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершениеЗавершение(Строка, ДополнительныеПараметры1) Экспорт
	
	ПараметрКоманды = ДополнительныеПараметры1.ПараметрКоманды;
	Текст = ?(Строка = Неопределено, ДополнительныеПараметры1.Текст, Строка);
	
	МаркетПлейсВызовСервера.ОтправитьДанныеУслугиРазработчику(ПараметрКоманды, Текст);

КонецПроцедуры




&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	
КонецПроцедуры 
