
Процедура ПриЗаписи(Отказ)
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Начало");
	//
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Начало");
	//	

	Если НЕ МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Вместо") Тогда
		
		// регистр ТекущиеСогласования
		Движения.ТекущиеСогласования.Записывать = Истина;
		Движение = Движения.ТекущиеСогласования.Добавить();
		Движение.ОбъектСогласования = ОбъектСогласования;
		Движение.Командируемый = Командируемый;
		
	КонецЕсли;
	
	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Конец");

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Начало");
	//
	Если НЕ МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Вместо") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
			ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
			ЭтотОбъект.ОбъектСогласования = ДанныеЗаполнения;
			
			//Найти актуальную схему
			Если ТипЗнч(ЭтотОбъект.ОбъектСогласования) = Тип("ДокументСсылка.Услуга") Тогда
				//
				ВхУслуга = ЭтотОбъект.ОбъектСогласования;
				
				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("Партнер", 		ВхУслуга.Партнер);
				ПараметрыПоиска.Вставить("Контрагент", 		ВхУслуга.Контрагент);
				ПараметрыПоиска.Вставить("Договор", 		ВхУслуга.Договор);
				ПараметрыПоиска.Вставить("Командируемый", 	Справочники.Командированные.ПустаяСсылка());
				
				ЭтотОбъект.СхемаСогласования = УправлениеБТСервер.ПолучитьАктуальнуюСхемуСогласования(ПараметрыПоиска);
				
			ИначеЕсли ТипЗнч(ЭтотОбъект.ОбъектСогласования) = Тип("ДокументСсылка.ЗаказКомандированногоБТ") Тогда
				//
				ВхКомандировка = ЭтотОбъект.ОбъектСогласования;
				
				ЭтотОбъект.Командируемый = ВхКомандировка.Командированный;
				
				ПараметрыПоиска = Новый Структура;
				ПараметрыПоиска.Вставить("Партнер", 		ВхКомандировка.Партнер);
				ПараметрыПоиска.Вставить("Контрагент", 		ВхКомандировка.Контрагент);
				ПараметрыПоиска.Вставить("Договор", 		ВхКомандировка.Договор);
				ПараметрыПоиска.Вставить("Командируемый", 	ВхКомандировка.Командированный);
				
				ЭтотОбъект.СхемаСогласования = УправлениеБТСервер.ПолучитьАктуальнуюСхемуСогласования(ПараметрыПоиска);
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Конец");
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Начало");
	//	
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Начало");
	//	
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Начало");
	
	Если НЕ МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Вместо") Тогда
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Автор) Тогда
			ЭтотОбъект.Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
	КонецЕсли;

	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Конец");
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Конец");
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Конец");
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Конец");
КонецПроцедуры
