
Функция ПолучитьАктуальныеНастройки(Партнер, Контрагент, Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("КонтрагентПустой", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ДоговорПустой", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктуальныйДокументФормированияДокументовСрезПоследних.Регистратор КАК Регистратор,
	               |	1 КАК Приоритет
	               |ПОМЕСТИТЬ АктуальныйДокумент
	               |ИЗ
	               |	РегистрСведений.АктуальныйДокументФормированияДокументов.СрезПоследних КАК АктуальныйДокументФормированияДокументовСрезПоследних
	               |ГДЕ
	               |	АктуальныйДокументФормированияДокументовСрезПоследних.Партнер = &Партнер
	               |	И АктуальныйДокументФормированияДокументовСрезПоследних.Контрагент = &Контрагент
	               |	И АктуальныйДокументФормированияДокументовСрезПоследних.Договор = &Договор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Регистратор,
	               |	2
	               |ИЗ
	               |	РегистрСведений.АктуальныйДокументФормированияДокументов.СрезПервых КАК АктуальныйДокументФормированияДокументовСрезПервых
	               |ГДЕ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Партнер = &Партнер
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Контрагент = &Контрагент
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Договор = &ДоговорПустой
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Регистратор,
	               |	3
	               |ИЗ
	               |	РегистрСведений.АктуальныйДокументФормированияДокументов.СрезПервых КАК АктуальныйДокументФормированияДокументовСрезПервых
	               |ГДЕ
	               |	АктуальныйДокументФормированияДокументовСрезПервых.Партнер = &Партнер
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Контрагент = &КонтрагентПустой
	               |	И АктуальныйДокументФормированияДокументовСрезПервых.Договор = &ДоговорПустой
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МИНИМУМ(АктуальныйДокумент.Приоритет) КАК Приоритет
	               |ПОМЕСТИТЬ МинимальныйПриоритет
	               |ИЗ
	               |	АктуальныйДокумент КАК АктуальныйДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктуальныйДокумент.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ АктуальныйДокумент2
	               |ИЗ
	               |	МинимальныйПриоритет КАК МинимальныйПриоритет
	               |		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныйДокумент КАК АктуальныйДокумент
	               |		ПО МинимальныйПриоритет.Приоритет = АктуальныйДокумент.Приоритет
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Партнер КАК Партнер,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Контрагент КАК Контрагент,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Договор КАК Договор,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.УсловияОтбора КАК УсловияОтбора,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.ШаблонНомераАкта КАК ШаблонНомераАкта,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.ШаблонНомераСчетФактуры КАК ШаблонНомераСчетФактуры,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.ШаблонНомераСчета КАК ШаблонНомераСчета,
	               |	УсловияЗаполненияЗаказаКлиентаБТ.Регистратор КАК Регистратор
	               |ИЗ
	               |	АктуальныйДокумент2 КАК АктуальныйДокумент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияЗаполненияЗаказаКлиентаБТ КАК УсловияЗаполненияЗаказаКлиентаБТ
	               |		ПО АктуальныйДокумент.Регистратор = УсловияЗаполненияЗаказаКлиентаБТ.Регистратор";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
КонецФункции