
Функция ПолучитьКомандыПоОбъекту(ПутьКОбъекту, Вид = ".epf") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка КАК Ссылка,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПредставлениеОбъекта КАК ПредставлениеОбъекта,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных КАК ПутьКОбъектуМетаданных,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокОбъектов КАК ДополнительныеОтчетыИПечатныеФормыСписокОбъектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокКоманд КАК ДополнительныеОтчетыИПечатныеФормыСписокКоманд
	               |		ПО ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка = ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Ссылка
	               |ГДЕ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Использовать = ИСТИНА
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных ПОДОБНО &ПутьКОбъектуМетаданных
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Вид = &Вид
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Использовать = ИСТИНА";
	Запрос.УстановитьПараметр("ПутьКОбъектуМетаданных", ПутьКОбъекту);
	Запрос.УстановитьПараметр("Вид", Вид);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции

Функция ПолучитьВсеКомандыПоОбъекту(ПутьКОбъекту, Вид = ".epf") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка КАК Ссылка,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПредставлениеОбъекта КАК ПредставлениеОбъекта,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных КАК ПутьКОбъектуМетаданных,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ИмяКоманды КАК ИмяКоманды,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Использовать
	               |		ИЛИ ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Использовать КАК Использовать
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокОбъектов КАК ДополнительныеОтчетыИПечатныеФормыСписокОбъектов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИПечатныеФормы.СписокКоманд КАК ДополнительныеОтчетыИПечатныеФормыСписокКоманд
	               |		ПО ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка = ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Ссылка
	               |ГДЕ
	               |	ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.ПутьКОбъектуМетаданных ПОДОБНО &ПутьКОбъектуМетаданных
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.Вид = &Вид
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокОбъектов.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |	И ДополнительныеОтчетыИПечатныеФормыСписокКоманд.Ссылка.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ПутьКОбъектуМетаданных", ПутьКОбъекту);
	Запрос.УстановитьПараметр("Вид", Вид);
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выгрузка;
	
КонецФункции


Функция ПолучитьМакетОбъекта(ПутьКОбъекту) Экспорт
	
		
	
КонецФункции