


Процедура ДобавитьКомандуСтруктураПодчиненности(ИмяМодуля, КомандыОтчетов) Экспорт
	
	Модуль = Неопределено;
	Попытка
		Выполнить("Модуль = "+ ИмяМодуля);
		Модуль.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	Исключение
		//	
	КонецПопытки
	
КонецПроцедуры


Процедура ДобавитьКомандуДвиженияДокумента(ИмяМодуля, КомандыОтчетов) Экспорт
	
	Модуль = Неопределено;
	Попытка
		Выполнить("Модуль = "+ ИмяМодуля);
		Модуль.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	Исключение
		//	
	КонецПопытки
	
КонецПроцедуры


