
Функция ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, ДополнительноеДействие);
КонецФункции

Функция ПриЗаписи(ЭтотОбъект, Отказ, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ПриЗаписи(ЭтотОбъект, Отказ, ДополнительноеДействие);	
КонецФункции

Функция ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, ДополнительноеДействие);	
КонецФункции

Функция ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ДополнительноеДействие);	
КонецФункции

Функция ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, ДополнительноеДействие);	
КонецФункции

Функция ПередУдалением(ЭтотОбъект, Отказ, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ПередУдалением(ЭтотОбъект, Отказ, ДополнительноеДействие);	
КонецФункции

Функция ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, ДополнительноеДействие);	
КонецФункции

Функция ПриКопировании(ЭтотОбъект, ОбъектКопирования, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ПриКопировании(ЭтотОбъект, ОбъектКопирования, ДополнительноеДействие);	
КонецФункции

Функция ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ДополнительноеДействие) Экспорт
	Возврат МаркетПлейсВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, ДополнительноеДействие);	
КонецФункции

