
&НаСервере
Процедура mytravelsGETНаСервере()
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("userguid1"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.userguid1 = Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Результат = УправлениеБТСервер.mytravelsGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура mytravelsGET(Команда)
	mytravelsGETНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьМетаданныеНаСервере()
	Справочники.ИдентификаторыОбъектовМетаданных.ОбновитьДанныеСправочника(); //ОбновитьДанныеСправочника	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьМетаданные(Команда)
	ОбновитьМетаданныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура mytravelGETНаСервере()
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("userguid, travelguid"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.userguid = Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Запрос.ПараметрыURL.travelguid = Строка(ЭтаФорма.ДокументСсылка.УникальныйИдентификатор());
	Результат = УправлениеБТСервер.mytravelGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура mytravelGET(Команда)
	mytravelGETНаСервере();
КонецПроцедуры

&НаСервере
Процедура myautorizationsGETНаСервере()
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("userguid2"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.userguid2 = Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Результат = УправлениеБТСервер.myautorizationsGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура myautorizationsGET(Команда)
	myautorizationsGETНаСервере();
КонецПроцедуры

&НаСервере
Процедура findocsНаСервере()
	Запрос = Новый Структура("ПараметрыURL, ПолучитьТелоКакСтроку", Новый Структура("num"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.num = 1;//Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Запрос.ПолучитьТелоКакСтроку = ТелоЗапроса;
	Результат = УправлениеБТСервер.findocsGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура findocs(Команда)
	findocsНаСервере();
КонецПроцедуры

&НаСервере
Процедура findocНаСервере()
	///{guid}/{typedoc}/*
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("guid, typedoc"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.guid = Строка(ЭтаФорма.ДокументСсылка.УникальныйИдентификатор());
	Запрос.ПараметрыURL.typedoc = "pdf";//Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Результат = УправлениеБТСервер.findocGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура findoc(Команда)
	findocНаСервере();
КонецПроцедуры

&НаСервере
Процедура etiketsНаСервере()
	Запрос = Новый Структура("ПараметрыURL, ПолучитьТелоКакСтроку", Новый Структура("nom"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.nom = 1;//Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Запрос.ПолучитьТелоКакСтроку = ТелоЗапроса;
	Результат = УправлениеБТСервер.etiketsGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура etikets(Команда)
	etiketsНаСервере();
КонецПроцедуры

&НаСервере
Процедура etiketНаСервере()
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("guid1, typedoc1"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.guid1 = Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Запрос.ПараметрыURL.typedoc1 = "pdf";//Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Результат = УправлениеБТСервер.etiketGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура etiket(Команда)
	etiketНаСервере();
КонецПроцедуры

&НаСервере
Процедура getreportsGETНаСервере()
	Запрос = Новый Структура("ПараметрыURL", Новый Структура());// HTTPСервисЗапрос;
	
	ЖСОН = Новый Структура("userguid", "e7bfb1fe-43a7-11e8-8d2c-003048da13ff");	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ЖСОН); // сериализует ОтветМассив в формат JSON
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Запрос.Вставить("ПолучитьТелоКакСтроку", ТелоЗапроса);
	
	Результат = УправлениеБТСервер.getreportsGET(Запрос).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура getreportsGET(Команда)
	getreportsGETНаСервере();
КонецПроцедуры

&НаСервере
Процедура generatereportGETНаСервере()
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("guidreport1, typedoc"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.guidreport1 = "a9a06c87-35ec-47a1-be78-29d58dfe93ff"; //Строка(ЭтаФорма.Командируемый.УникальныйИдентификатор());
	Запрос.ПараметрыURL.typedoc = "pdf";
	
	ЖСОН = Новый Структура("name, values, userguid", "datefrom", Дата(1,1,1,0,0,0), "e7bfb1fe-43a7-11e8-8d2c-003048da13ff");	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,ЖСОН); // сериализует ОтветМассив в формат JSON
	ТелоЗапроса = ЗаписьJSON.Закрыть();
	Запрос.Вставить("ПолучитьТелоКакСтроку", ТелоЗапроса);
	
	Результат = УправлениеБТСервер.generatereportGET(Запрос, ТелоЗапроса).ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура generatereportGET(Команда)
	generatereportGETНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыЖСОН = Новый Структура(
		"name, values, userguid",
		"datefrom", "0001-01-01T00:00:00", "e7bfb1fe-43a7-11e8-8d2c-003048da13ff"
	);
	
	ТелоЗапроса = УправлениеБТВызовСервера.ВJSON(ПараметрыЖСОН);
КонецПроцедуры








&НаСервере
Процедура SAASReadНаСервере()
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("typeobject, link"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.typeobject = "Услуга";
	Запрос.ПараметрыURL.link = "49756fed-80f5-11e8-8d30-003048da13ff";
	
	HTTPСервиссОтвет = УправлениеБТСервер.SAASПолучитьДанные(Запрос, "");
	
	Результат = HTTPСервиссОтвет.ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура SAASRead(Команда)
	SAASReadНаСервере();
КонецПроцедуры

&НаСервере
Процедура SAASWriteНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура SAASWrite(Команда)
	SAASWriteНаСервере();
КонецПроцедуры





&НаСервере
Процедура GetChatНаСервере()
	
	Запрос = Новый Структура("ПараметрыURL, ПолучитьТелоКакСтроку", Новый Структура("typechat"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.typechat = "Telegram";
	Запрос.ПолучитьТелоКакСтроку = "";
		
	HTTPСервиссОтвет =  ЧатБотБТСервер.ChatBOTПолучитьЧат(Запрос);
	Результат = HTTPСервиссОтвет.ПолучитьТелоКакСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура GetChat(Команда)
	GetChatНаСервере();
КонецПроцедуры

&НаСервере
Процедура SetOrderНаСервере()
	
	Запрос = Новый Структура("ПараметрыURL, ПолучитьТелоКакСтроку", Новый Структура("typechat"));// HTTPСервисЗапрос;
	Запрос.ПараметрыURL.typechat = "Telegram";
	Запрос.ПолучитьТелоКакСтроку = ТелоЗапросаЧатБота;
		
	HTTPСервиссОтвет =  ЧатБотБТСервер.ChatBOTСоздатьЗаказ(Запрос);
	Результат = HTTPСервиссОтвет.ПолучитьТелоКакСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура SetOrder(Команда)
	SetOrderНаСервере();
КонецПроцедуры


&НаСервере
Функция ПолучитьТекстОтвета()
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Макет = ОбъектСервер.ПолучитьМакет("ЧатБот");
	
	СтруктураОтвета = УправлениеБТВызовСервера.ИзJSON(Макет.ПолучитьТекст());
	JsonText = УправлениеБТВызовСервера.ВJSON(СтруктураОтвета);
	
	Возврат УправлениеБТВызовСервера.ДобавитьТабыВJSON(JsonText);
КонецФункции

&НаКлиенте
Процедура Группа6ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаЧатБот" Тогда
		ВхТело = ПолучитьТекстОтвета();		
		ТелоЗапросаЧатБота = ВхТело;
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура SAASListНаСервере()
	
	ТелоЗапроса = "";
	Запрос = Новый Структура("ПараметрыURL", Новый Структура("typelist, typeobject", "table", "Услуга"));
	Ответ = УправлениеБТСервер.SAASПолучитьЛист(Запрос, ТелоЗапроса);
	
	Результат = Ответ.ПолучитьТелоКакСтроку();
КонецПроцедуры

&НаКлиенте
Процедура SAASList(Команда)
	SAASListНаСервере();
КонецПроцедуры
