
&НаСервереБезКонтекста
Функция ФайлыВыборСервер(Объект, GUIDФайла)
	
	Адрес = "";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФайлыДляОтправкиВОблако.Период,
	               |	ФайлыДляОтправкиВОблако.GUID,
	               |	ФайлыДляОтправкиВОблако.Объект,
	               |	ФайлыДляОтправкиВОблако.ИмяФайла,
	               |	ФайлыДляОтправкиВОблако.Отправлено,
	               |	ФайлыДляОтправкиВОблако.ДД,
	               |	ФайлыДляОтправкиВОблако.md5,
	               |	ФайлыДляОтправкиВОблако.ТипВложения
	               |ИЗ
	               |	РегистрСведений.ФайлыДляОтправкиВОблако КАК ФайлыДляОтправкиВОблако
	               |ГДЕ
	               |	ФайлыДляОтправкиВОблако.md5 = &md5
	               |	И ФайлыДляОтправкиВОблако.Объект = &Объект";
	Запрос.УстановитьПараметр("md5", GUIDФайла);
	Запрос.УстановитьПараметр("Объект",Объект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДД = УправлениеБТВызовСервера.ПолучитьФайлИзОблака(Выборка.md5);
		Адрес = ПоместитьВоВременноеХранилище(ДД);		
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура СписокЗагрузокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Адрес = ФайлыВыборСервер(СсылкаНаОбъект, Элемент.ТекущаяСтрока.GUIDФайла);			
	Если ЗначениеЗаполнено(Адрес) Тогда 
		ДД = ПолучитьИзВременногоХранилища(Адрес);
		HttpБуфер = Новый HTTPЗапрос;
		HttpБуфер.УстановитьТелоИзДвоичныхДанных(ДД);
		СтрокаСодержимое = HttpБуфер.ПолучитьТелоКакСтроку();
		
		Если Элемент.ТекущиеДанные.ИмяФайла = "json.file" Тогда
			//
			СтруктураЖСОН = УправлениеБТВызовСервера.ИзJSON(СтрокаСодержимое);
			//ЧтениеJSON = Новый ЧтениеJSON; 
			//ЧтениеJSON.УстановитьСтроку(СтрокаСодержимое);
			//СтруктураЖСОН = ПрочитатьJSON(ЧтениеJSON);
			//ЧтениеJSON.Закрыть();
			
			СтрокаСодержимое = УправлениеБТВызовСервера.ВJSON(СтруктураЖСОН);
			//ЗапистьJSON = Новый ЗаписьJSON;
			//ЗапистьJSON.УстановитьСтроку();
			//ЗаписатьJSON( ЗапистьJSON, СтруктураЖСОН);
			//СтрокаСодержимое = ЗапистьJSON.Закрыть();				
		КонецЕсли;
		
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(СтрокаСодержимое);
		Текст.Показать(Элемент.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаОбъект = Неопределено;
	ЭтаФорма.Параметры.Свойство("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Если СсылкаНаОбъект <> Неопределено Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗагрузкиВОбъекты.НастройкаЗагрузки КАК НастройкаЗагрузки,
		               |	ЗагрузкиВОбъекты.GUIDФайла КАК GUIDФайла,
		               |	ЗагрузкиВОбъекты.ДатаЗагрузки КАК ДатаЗагрузки,
		               |	ЗагрузкиВОбъекты.Объект КАК Объект
		               |ПОМЕСТИТЬ ВОбъектах
		               |ИЗ
		               |	РегистрСведений.ЗагрузкиВОбъекты КАК ЗагрузкиВОбъекты
		               |ГДЕ
		               |	ЗагрузкиВОбъекты.Объект = &Объект
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВОбъектах.НастройкаЗагрузки КАК НастройкаЗагрузки,
		               |	ВОбъектах.GUIDФайла КАК GUIDФайла,
		               |	ВОбъектах.ДатаЗагрузки КАК ДатаЗагрузки,
		               |	МАКСИМУМ(ФайлыДляОтправкиВОблако.ИмяФайла) КАК ИмяФайла
		               |ИЗ
		               |	ВОбъектах КАК ВОбъектах
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФайлыДляОтправкиВОблако КАК ФайлыДляОтправкиВОблако
		               |		ПО ВОбъектах.GUIDФайла = ФайлыДляОтправкиВОблако.md5
		               |			И ВОбъектах.Объект = ФайлыДляОтправкиВОблако.Объект
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВОбъектах.НастройкаЗагрузки,
		               |	ВОбъектах.GUIDФайла,
		               |	ВОбъектах.ДатаЗагрузки";
		Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект);
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		СписокЗагрузок.Загрузить(Выгрузка);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ЗагрузкаДанных(Файл, СсылкаНаОбъект, НастройкаЗагрузки)
	
	УправлениеБТСервер.ЗагрузитьДанныеВУслугу(Файл, СсылкаНаОбъект, НастройкаЗагрузки);
	
КонецФункции

&НаКлиенте
Процедура СписокЗагрузокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СокрЛП(Элемент.ТекущиеДанные.Файл) <> "" Тогда
		ТД = Элемент.ТекущиеДанные;
		ИсхСтруктура = Новый Структура("ИсходнаяМаска, ИмяФайла", ТД.Файл, ТД.ИмяФайла);
		ЗагрузкаДанных(ИсхСтруктура, СсылкаНаОбъект, ТД.НастройкаЗагрузки);
		
		Оповестить("ИзменениеУслуги", СсылкаНаОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗагрузокПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные <> Неопределено Тогда 
		Адрес = ФайлыВыборСервер(СсылкаНаОбъект, Элемент.ТекущиеДанные.GUIDФайла);			
		Если ЗначениеЗаполнено(Адрес) Тогда 
			ДД = ПолучитьИзВременногоХранилища(Адрес);
			СтрокаСодержимое = "";
			Если ДД <> Ложь Тогда 
				HttpБуфер = Новый HTTPЗапрос;
				HttpБуфер.УстановитьТелоИзДвоичныхДанных(ДД);
				СтрокаСодержимое = HttpБуфер.ПолучитьТелоКакСтроку();
			КонецЕсли;	
			Элемент.ТекущиеДанные.Файл = СтрокаСодержимое; 
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры
