
Процедура ПриЗаписи(Отказ)

	Если НЕ Отказ Тогда
		Если НЕ ЭтотОбъект.ПометкаУдаления Тогда
			Если ТипЗнч(ЭтотОбъект.ОбъектЗадачи) = Тип("ДокументСсылка.СогласованиеКомандировки") Тогда 
				МЗ = РегистрыСведений.СогласованиеКомандировокТочкиМаршрута.СоздатьМенеджерЗаписи();	
				МЗ.ЗадачаКлиента = ЭтотОбъект.Ссылка;
				МЗ.СогласованиеКомандировки = ЭтотОбъект.ОбъектЗадачи;
				МЗ.ТочкаМаршрута = ЭтотОбъект.ТочкаМаршрутаЗадачи;
				МЗ.Записать(Истина);
			КонецЕсли;
		Иначе
			МЗ = РегистрыСведений.СогласованиеКомандировокТочкиМаршрута.СоздатьМенеджерЗаписи();	
			МЗ.ЗадачаКлиента = ЭтотОбъект.Ссылка;
			МЗ.Прочитать();
			МЗ.Удалить();
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	
	Если НЕ Отказ Тогда
		УправлениеБТСервер.СоздатьСледующуюЗадачуСогласования(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
