
//Перенести в общий модуль ПОВТОРЯЮЩИЙСЯ
Процедура ДобавитьОтчетВДерево(ДеревоОтчетов, Отчет) Экспорт
	
	Для Каждого ЭлементОтчета ИЗ Отчет Цикл
		ЕстьЭлемент = Ложь;
		
		Для Каждого ЭлементДерева ИЗ ДеревоОтчетов Цикл
			Если ЭлементОтчета.guid = ЭлементДерева.guid Тогда
				//Есть уже такой элемент
				ЕстьЭлемент = Истина;
				Если ЭлементОтчета.Свойство("nodes") Тогда
					ДобавитьОтчетВДерево(ЭлементДерева.nodes, ЭлементОтчета.nodes);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ЕстьЭлемент Тогда
			ДеревоОтчетов.Добавить(ЭлементОтчета);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
