
&НаСервере
Функция ПолучитьJSON()
	ДЗ = ДанныеФормыВЗначение(РучнойОтбор,Тип("ДеревоЗначений"));
	ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(ДЗ);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектXDTO);
	Стр = ЗаписьJSON.Закрыть(); 
	
	Возврат Стр; 
КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)
	
	ТД = Элементы.РучнойОтбор.ТекущиеДанные;
	
	Результат = Новый Структура("Значение");
	//Результат.ДеревоПравил = ПолучитьJSON();
	Результат.Значение = ТД.Путь;
	
	Закрыть(Результат);
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДерево(ЭлементыДерева, ВхМассив, Путь = "")
	
	Точка = ?(Путь = "", "", ".");
	Для Каждого ЭлементМассиваИлиСтруктуры ИЗ ВхМассив Цикл
		Если ТипЗнч(ЭлементМассиваИлиСтруктуры) = Тип("КлючИЗначение") Тогда 
			Если ТипЗнч(ЭлементМассиваИлиСтруктуры.Значение) = Тип("Соответствие") Тогда
				Элемент = ЭлементыДерева.Добавить();
				Элемент.Параметр = ЭлементМассиваИлиСтруктуры.Ключ;
				Элемент.Значение = "Соответствие";
				Элемент.Путь = Путь + Точка + ЭлементМассиваИлиСтруктуры.Ключ;
				
				ДобавитьВДерево(Элемент.Строки, ЭлементМассиваИлиСтруктуры.Значение, Путь + Точка + ЭлементМассиваИлиСтруктуры.Ключ);
				
			ИначеЕсли ТипЗнч(ЭлементМассиваИлиСтруктуры.Значение) = Тип("Массив") Тогда
				
				Элемент = ЭлементыДерева.Добавить();
				Элемент.Параметр = ЭлементМассиваИлиСтруктуры.Ключ;
				Элемент.Значение = "Массив";
				Элемент.Путь = Путь + Точка + ЭлементМассиваИлиСтруктуры.Ключ;
				ДобавитьВДерево(Элемент.Строки, ЭлементМассиваИлиСтруктуры.Значение, Элемент.Путь);
				
				//Элемент = ЭлементыДерева.Добавить();
				//Элемент.Параметр = ЭлементМассиваИлиСтруктуры.Ключ;
				//Элемент.Значение = "Массив";
				//Элемент.Путь = Путь + Точка + ЭлементМассиваИлиСтруктуры.Ключ;
				////ДобавитьВДерево(Элемент.Строки, ЭлементМассиваИлиСтруктуры.Значение, Путь + "[0]");
				
			Иначе
				Элемент = ЭлементыДерева.Добавить();
				Элемент.Параметр = ЭлементМассиваИлиСтруктуры.Ключ;
				Элемент.Значение = ЭлементМассиваИлиСтруктуры.Значение;
				Элемент.Путь = Путь + Точка + ЭлементМассиваИлиСтруктуры.Ключ
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементМассиваИлиСтруктуры) = Тип("Соответствие") Тогда
			Если Тип("Массив") = ТипЗнч(ВхМассив) Тогда
				
				Элемент = ЭлементыДерева.Добавить();
				Элемент.Параметр = "[]";
				Элемент.Значение = "Массив";
				Элемент.Путь = Путь + Точка + "[]";
				ДобавитьВДерево(Элемент.Строки, ЭлементМассиваИлиСтруктуры, Элемент.Путь);

			КонецЕсли;
			
			//ИндексСтроки = 0;
			//Для Каждого ЭлементМассива ИЗ ЭлементМассиваИлиСтруктуры Цикл
			//	ИндексСтроки = ИндексСтроки+1; 
			//	
			//	Элемент = ЭлементыДерева.Добавить();
			//	Элемент.Параметр = Строка(ИндексСтроки);
			//	Элемент.Значение = "Строка";
			//	
			//	ДобавитьВДерево(Элемент.Строки, ЭлементМассива, Путь + Точка + Строка(ИндексСтроки));
			//КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЖСОН = "";
	ЭтаФорма.Параметры.Свойство("ЖСОН", ЖСОН);
	
	Если ЗначениеЗаполнено(ЖСОН) Тогда
		ЧтениеJSON = Новый ЧтениеJSON; 
		//ЖСОН = СтрЗаменить(ЖСОН, "@attributes", "_attributes");
		ЧтениеJSON.УстановитьСтроку(ЖСОН);
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
		
		РучнойОтборСервер = РеквизитФормыВЗначение("РучнойОтбор");
		РучнойОтборСервер.Строки.Очистить();		
		ДобавитьВДерево(РучнойОтборСервер.Строки, Результат);
		ЗначениеВРеквизитФормы(РучнойОтборСервер,"РучнойОтбор");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РучнойОтборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Неопределено);
КонецПроцедуры


