

&НаСервере
Процедура ЗаполнитьПараметрыПоОбработке(СсылкаНаФайлВоВХ, Расширение) Экспорт
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ДополнительныеОтчетыИПечатныеФормыВызовСервер.ЗаполнитьПараметрыПоОбработке(ОбъектСервер, СсылкаНаФайлВоВХ, Расширение);
	ЗначениеВРеквизитФормы(ОбъектСервер, "Объект");
КонецПроцедуры


&НаКлиенте
Процедура СохранитьОбработку(Команда)
	Если Объект.НаименованиеОбработки = "" Тогда
		ПоказатьПредупреждение( ,"У вас нет сохраненного в базе обработки");
	Иначе
		Режим = РежимДиалогаВыбораФайла.Сохранение;
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПолноеИмяФайла = "";
		Фильтр = "Внешняя обработка (*.epf)|*.epf";
		
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.НаименованиеОбработки;
		
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаСохранение", ЭтотОбъект, "");
		ДиалогОткрытияФайла.Показать(Оп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(Пар1, Пар2) Экспорт
	
	Если ТипЗнч(Пар1) = Тип("Массив") Тогда
		
	    Для Каждого ИмяФайла Из Пар1 Цикл
			Файл = Новый Файл(ИмяФайла);
			Имя = Файл.Имя;
			Расширение = Файл.Расширение;
			
			ДД = Новый ДвоичныеДанные(ИмяФайла);
			СсылкаНаФайлВоВременномХранилище = ПоместитьВоВременноеХранилище(ДД, ЭтаФорма.УникальныйИдентификатор);
			
			Модифицированность = Истина; 
			Объект.НаименованиеОбработки = Имя;
			Если Объект.Наименование = "" Тогда
				Объект.Наименование = Объект.НаименованиеОбработки;
			КонецЕсли;
			
			СсылкаНаФайлВоВХ = ПоместитьВоВременноеХранилище(ДД);
			ЗаполнитьПараметрыПоОбработке(СсылкаНаФайлВоВХ, Расширение);
		КонецЦикла;
			
	Иначе
	    ПоказатьПредупреждение( ,НСтр("ru = 'Файл не выбран!'; en = 'File not selected!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаСохранение(Пар1, Пар2) Экспорт
	
	Если ТипЗнч(Пар1) = Тип("Массив") Тогда
		
		Для Каждого ИмяФайла Из Пар1 Цикл
			СсылкаНаФайлВИБ = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ВнешняяОбработка");			
			ПолучитьФайл(СсылкаНаФайлВИБ, ИмяФайла, Ложь);
		КонецЦикла;
		
	Иначе
	    ПоказатьПредупреждение(,НСтр("ru = 'Файл не выбран!'; en = 'File not selected!'"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработку(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Внешняя обработка (*.epf)|*.epf";
	
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект, "");
	ДиалогОткрытияФайла.Показать(Оп);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(СсылкаНаФайлВоВременномХранилище) Тогда
		УдалитьИзВременногоХранилища(СсылкаНаФайлВоВременномХранилище);
		СсылкаНаФайлВоВременномХранилище = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(СсылкаНаФайлВоВременномХранилище) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(СсылкаНаФайлВоВременномХранилище);
		ТекущийОбъект.ВнешняяОбработка = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	КонецЕсли;       

КонецПроцедуры




&НаСервере
Функция ПолучитьДД()
	ОбъектСервер = РеквизитФормыВЗначение("Объект"); 
	ДД = ОбъектСервер.ВнешняяОбработка.Получить();
    Возврат ДД;
КонецФункции

&НаКлиенте
Процедура СформироватьКомпоненту(Команда)
	
	
	Если ЭтаФорма.Модифицированность Тогда
		Сообщить("Сохраните предварительно настройку");		
	Иначе	
		
		//Создать компонент по умолчанию
		Если Объект.Вид = ".erf" Тогда
			ТипКомпоненты = ПредопределенноеЗначение("Перечисление.ТипыДополнительногоФункционала.КомпонентОтчета");
		Иначе
			ТипКомпоненты = ПредопределенноеЗначение("Перечисление.ТипыДополнительногоФункционала.КомпонентПечатнойФормы");
		КонецЕсли;
		
		ДД = ПолучитьДД();
		ПараметрыВнутри = Новый Структура("Наименование, ТипДопФункционала, ДД, ИмяФайла", 
			Объект.Наименование, 
			ТипКомпоненты, 
			ДД,
			Объект.НаименованиеОбработки
		);
				
		Если ЗначениеЗаполнено(Объект.ДополнительныйФункционал) Тогда
			ПараметрыВнутри.Вставить("ДополнительныйФункционал", Объект.ДополнительныйФункционал);
		КонецЕсли;
		
		
		Объект.ДополнительныйФункционал = МаркетПлейсВызовСервера.СоздатьЭлементДополнительногоФункционала(ПараметрыВнутри);
		ЭтаФорма.Модифицированность = Истина;	
		
	КонецЕсли;	
		
КонецПроцедуры
