
&НаКлиенте
Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(Элемент.ТекущиеДанные.ГУИД);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокиВыбора = ЭтаФорма.Параметры.СтрокиВыбора;
	Если ТипЗнч(СтрокиВыбора) = Тип("Массив") Тогда
		Для Каждого СтрокаВ ИЗ СтрокиВыбора	Цикл
			НаваяСтрока = Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НаваяСтрока, СтрокаВ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
