
&НаСервереБезКонтекста
Функция НаименованиеПринтераВСистемеНачалоВыбораНаСервере()
	ВыборПринтеров = Новый Массив();
	Принтеры = Новый COMОбъект ("WScript.Network"); 
	СписокПринтеров = Принтеры.EnumPrinterConnections(); 
	Индекс = 0; 
	Пока Индекс < СписокПринтеров.Count()-1 Цикл 
	    ВыборПринтеров.Добавить(СписокПринтеров.Item(Индекс+1)); 
	    Индекс = Индекс + 2; 
	КонецЦикла; 
	Возврат ВыборПринтеров;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПринтеровНаСервере = НаименованиеПринтераВСистемеНачалоВыбораНаСервере();
	ЭтаФорма.Элементы.НаименованиеПринтераВСистеме.СписокВыбора.ЗагрузитьЗначения(СписокПринтеровНаСервере); // загоняем в комбобокс
	
КонецПроцедуры
