
&НаСервере
Функция ПолучитьJSONДерева()
	
	ОбъектСервер  = РеквизитФормыВЗначение("Объект");	
	Стр = ОбъектСервер.Условие;// Политики[ТС].Условие;
	Если НЕ ЗначениеЗаполнено(Стр) Тогда
		Стр = ""
	КонецЕсли;
	
	Возврат Стр;
КонецФункции

&НаСервере
Функция УстановитьJSONВДерево(Результат, ТС)
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда	
		ОбъектСервер = РеквизитФормыВЗначение("Объект");	
		ОбъектСервер.Условие = Результат.ДеревоПравил; //Новый ХранилищеЗначения(Результат.ДеревоПравил, Новый СжатиеДанных(9));
		ОбъектСервер.ПредставлениеУсловия = Результат.Представление;
		ЗначениеВРеквизитФормы(ОбъектСервер, "Объект");
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияОтбора(Результат, Параметр) Экспорт
	УстановитьJSONВДерево(Результат, Параметр);
КонецПроцедуры


&НаКлиенте
Процедура ПредставлениеУсловияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	//ТС = Элементы.Политики.ТекущиеДанные.ПолучитьИдентификатор();
	
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияОтбора", ЭтотОбъект);
	
	Пар = Новый Структура("ДеревоПравил, ОбъектУсловия");
	Пар.ДеревоПравил = ПолучитьJSONДерева();
	Пар.ОбъектУсловия = Объект.ОбъектУсловия;

	ОткрытьФорму("ОбщаяФорма.ФормаОтбора", Пар,,,,,Оп);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка = Справочники.ЭлементОтбора.ПустаяСсылка() Тогда
		//Это новый
		Если ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("ОбъектУсловия") Тогда
			Объект.ОбъектУсловия = ЭтаФорма.Параметры.ЗначенияЗаполнения.ОбъектУсловия;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
