

Процедура ОбработкаПолученияФормы(ТипМодуля = "", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	МаркетПлейсВызовСервера.ОбработкаПолученияФормы(ТипМодуля, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка, ДополнительноеДействие);
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ТипМодуля = "", ДанныеВыбора, Параметры, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	
	МаркетПлейсВызовСервера.ОбработкаПолученияДанныхВыбора(ТипМодуля, ДанныеВыбора, Параметры, СтандартнаяОбработка, ДополнительноеДействие);
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(ТипМодуля = "", Поля, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	
	МаркетПлейсВызовСервера.ОбработкаПолученияПолейПредставления(ТипМодуля, Поля, СтандартнаяОбработка, ДополнительноеДействие);
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(ТипМодуля = "", Данные, Представление, СтандартнаяОбработка, ДополнительноеДействие) Экспорт
	
	МаркетПлейсВызовСервера.ОбработкаПолученияПредставления(ТипМодуля, Данные, Представление, СтандартнаяОбработка, ДополнительноеДействие);
	
КонецПроцедуры



Процедура ДобавитьКомандыОтчетов(Модуль, КомандыОтчетов) Экспорт
	//
КонецПроцедуры

Процедура ДобавитьКомандыПечати(Модуль, КомандыПечати) Экспорт
	//
КонецПроцедуры

Процедура ДобавитьКомандыСозданияНаОсновании(Модуль, КомандыСоздатьНаОсновании) Экспорт
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДополнительныеКомандыВводНаОснованииСписокОбъектов.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ДопКоманды
	               |ИЗ
	               |	Справочник.ДополнительныеКомандыВводНаОсновании.СписокОбъектов КАК ДополнительныеКомандыВводНаОснованииСписокОбъектов
	               |ГДЕ
	               |	ДополнительныеКомандыВводНаОснованииСписокОбъектов.ПредставлениеОбъекта ПОДОБНО &ПредставлениеОбъекта
	               |	И ДополнительныеКомандыВводНаОснованииСписокОбъектов.Ссылка.Использовать = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Ссылка КАК Ссылка,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.НомерСтроки КАК НомерСтроки,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Использовать КАК Использовать,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Представление КАК Представление,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Обработчик КАК Обработчик,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Идентификатор КАК Идентификатор,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.МножественныйВыбор КАК МножественныйВыбор,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Менеджер КАК Менеджер,
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.РежимЗаписи КАК РежимЗаписи
	               |ИЗ
	               |	Справочник.ДополнительныеКомандыВводНаОсновании.СписокКоманд КАК ДополнительныеКомандыВводНаОснованииСписокКоманд
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДопКоманды КАК ДопКоманды
	               |		ПО ДополнительныеКомандыВводНаОснованииСписокКоманд.Ссылка = ДопКоманды.Ссылка
	               |ГДЕ
	               |	ДополнительныеКомандыВводНаОснованииСписокКоманд.Использовать = ИСТИНА";
	Запрос.УстановитьПараметр("ПредставлениеОбъекта", Модуль);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяКоманда = КомандыСоздатьНаОсновании.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяКоманда, Выборка);
	КонецЦикла;
	
КонецПроцедуры
