
&НаКлиенте
Процедура ЗагрузитьМодули(Команда)
	ОткрытьФорму("Справочник.ДополнительныйФункционал.Форма.Форма");
КонецПроцедуры





&НаСервере
Процедура ВыгрузитьМодулиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДополнительныйФункционал.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДополнительныйФункционал КАК ДополнительныйФункционал
	               |ГДЕ
	               |	ДополнительныйФункционал.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = МаркетПлейсВызовСервера.СоздатьМодульМаркетплейса(Выборка.Ссылка);	
		Если Результат.Результат Тогда
			МаркетПлейсВызовСервера.ОтправитьМодульМаркетплейса(Результат.ДД, Выборка.Ссылка);
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьМодули(Команда)
	ВыгрузитьМодулиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Информация = "";
КонецПроцедуры




&НаКлиенте
Процедура РасшаритьКомпоненту(Команда)
	
	ТД = Элементы.Список.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		МаркетПлейсКлиент.РасшаритьКомпонент(ТД.Ссылка);
	КонецЕсли;

КонецПроцедуры
