
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = Справочники.ФункцииОписания.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		ИмяПредопределенного = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Наименование = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		ТипФункции = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		КодФункции = Макет.Область(ТекущаяСтрока, 4, ТекущаяСтрока, 4).Текст;
		
		Если ИмяПредопределенного = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				//Метаданные.Справочники.ФункцииОписания.Предопределенные
				ЭлементСправочника = Справочники.ФункцииОписания[ИмяПредопределенного].ПолучитьОбъект();
				ЭлементСправочника.Наименование = Наименование;
				ЭлементСправочника.ТипФункции = Перечисления.ТипыВнешнихФукций[ТипФункции];
				ЭлементСправочника.КодФункции = КодФункции;
				ЭлементСправочника.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
