
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Если ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("ТипФункции") Тогда 
			Объект.ТипФункции = ЭтаФорма.Параметры.ЗначенияЗаполнения.ТипФункции;
		КонецЕсли;
	КонецЕсли;
	ТипФункцииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяМетаданных(Значение)
	
	Результат = "";
	
	Для Каждого ПЗначение ИЗ Значение.Метаданные().ЗначенияПеречисления Цикл
		Если ПЗначение.Синоним = Строка(Значение) Тогда
			Результат = ПЗначение.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ТипФункцииПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ТипФункции) Тогда
		ОбъектСервер = РеквизитФормыВЗначение("Объект");
		Имя = ПолучитьИмяМетаданных(Объект.ТипФункции); 
		Если Имя <> "" Тогда
			МакетИстория = ОбъектСервер.ПолучитьМакет(Имя);	
			ЭтаФорма.История = МакетИстория.ПолучитьТекст();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипФункцииПриИзменении(Элемент)
	ТипФункцииПриИзмененииНаСервере();
КонецПроцедуры
