

Функция СформироватьJSONНастроек(СсылкаНаДФ) Экспорт
	//
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДФ);
	Запрос.Текст = "ВЫБРАТЬ
	 |	ДополнительныйФункционалНастройкиСервера.Ссылка КАК Ссылка,
	 |	ДополнительныйФункционалНастройкиСервера.НомерСтроки КАК НомерСтроки,
	 |	ДополнительныйФункционалНастройкиСервера.Ключ КАК Ключ,
	 |	ДополнительныйФункционалНастройкиСервера.Значение КАК Значение
	 |ИЗ
	 |	Справочник.ДополнительныйФункционал.НастройкиСервера КАК ДополнительныйФункционалНастройкиСервера
	 |ГДЕ
	 |	ДополнительныйФункционалНастройкиСервера.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктураНастроек = Новый Структура("Name, Info", СсылкаНаДФ.ИмяСкриптаШины, Новый Массив);
	Пока Выборка.Следующий() Цикл                              
		СтруктураНастроек.Info.Добавить(Новый Структура(Выборка.Ключ, Выборка.Значение));
	КонецЦикла;
		
	Возврат СтруктураНастроек; 
Конецфункции