
Функция ВыполнитьПервоначальныйЗапуск() Экспорт
	
	Состояние = Новый Структура("Результат, Сообщение", Ложь, "Нет ссылки на обработку");
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		Состояние = МаркетПлейсСервер.ВыполнитьПервоначальныйЗапуск(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	Возврат Состояние;
КонецФункции

Процедура ЗаполнитьСписокОбрабатываемыхСобытий() Экспорт
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка) Тогда
		События = МаркетПлейсСервер.СписокСобытий(ЭтотОбъект.Ссылка);
		СписокОбрабатываемыхСобытий.Очистить();
		Для Каждого Событие ИЗ События Цикл
			НовоеСобытие = СписокОбрабатываемыхСобытий.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеСобытие, Событие);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьНастройкиСервера() Экспорт
	НС = Новый Массив();
	Для Каждого Настройка ИЗ ЭтотОбъект.НастройкиСервера Цикл
		НС.Добавить(Новый Структура(Настройка.Ключ, Настройка.Значение));
	КонецЦикла;
	СтруктураНастроек = Новый Структура(НРег(ЭтотОбъект.ИмяСкриптаШины), НС);	
	
	Возврат СтруктураНастроек;
КонецФункции

Функция ЗаполнитьНстройки(СтруктураНастроек) Экспорт
	
	СтарыеНастройки = Новый Структура();
	Для Каждого СтрокаНастроек ИЗ ЭтотОбъект.НастройкиСервера Цикл
		СтарыеНастройки.Вставить(СтрокаНастроек.Ключ, СтрокаНастроек.Значение);
	КонецЦикла;
	
	Если СтруктураНастроек.Свойство("Name") И СтруктураНастроек.Свойство("Info") Тогда 
		ЭтотОбъект.НастройкиСервера.Очистить();   
		ЭтотОбъект.ИмяСкриптаШины = СтруктураНастроек.Name;
		Информация = СтруктураНастроек.Info;
		Если ТипЗнч(Информация) = Тип("Массив") Тогда
			Для Каждого СтрокаИнформации ИЗ Информация Цикл 
				НоваяСтрока = ЭтотОбъект.НастройкиСервера.Добавить();
				Для Каждого КлючЗначение ИЗ СтрокаИнформации Цикл
					НоваяСтрока.Ключ = КлючЗначение.Ключ;
					НоваяСтрока.Значение = КлючЗначение.Значение;
				КонецЦикла;
				
				Если НЕ ЗначениеЗаполнено(НоваяСтрока.Значение) Тогда 
					СтарыеНастройки.Свойство(НоваяСтрока.Ключ, НоваяСтрока.Значение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции



