
Процедура ПриЗаписи(Отказ)
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Начало");
	//
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Начало");
	//	 	
	// регистр КомиссииПоставщиков
	Если НЕ МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Вместо") Тогда
		УправлениеБТСервер.ЗаписатьGUID(Ссылка);

		Движения.КомиссииПоставщиков.Записывать = Истина;
		Для Каждого ТекСтрокаКоммиссионныеУсловия Из КоммиссионныеУсловия Цикл
			Движение = Движения.КомиссииПоставщиков.Добавить();
			
			Движение.Регистратор = Ссылка;
			Движение.Период = Дата;
			
			Движение.Партнер = Партнер;
			//Движение.НоменклатураБТ = ТекСтрокаСвязанныеНоменклатуры.ОсновнаяНоменклатура;
			Движение.Поставщик = Поставщик;
			Движение.ДоговорПоставщика = ДоговорПоставщика;
			Движение.Клиент = Клиент;
			Движение.Контрагент = Контрагент;
			Движение.ДоговорКонтрагента = ДоговорКонтрагента;
			Движение.Клиент = Клиент;
			
			Движение.Условие = ТекСтрокаКоммиссионныеУсловия.Условие;
			Движение.ПрименяетсяК = ТекСтрокаКоммиссионныеУсловия.ПрименяетсяК;
			
			Движение.ВПроцентах = ТекСтрокаКоммиссионныеУсловия.ВПроцентах;
			Движение.Цена = ТекСтрокаКоммиссионныеУсловия.Цена;
			Движение.СтавкаНДС = ТекСтрокаКоммиссионныеУсловия.СтавкаНДС;
			Движение.СуммаНДС = ТекСтрокаКоммиссионныеУсловия.СуммаНДС;
			Движение.СуммаКомиссии = ТекСтрокаКоммиссионныеУсловия.СуммаКомиссии;
			
			Движение.НеМенееЧем = ТекСтрокаКоммиссионныеУсловия.НеМенееЧем;
			Движение.НеБолееЧем = ТекСтрокаКоммиссионныеУсловия.НеБолееЧем;
			
			Движение.ШаблонСвязаннойУслуги = ТекСтрокаКоммиссионныеУсловия.ШаблонСвязаннойУслуги;

		КонецЦикла;
	КонецЕсли;	

	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Конец");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Начало");
	//
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Конец");
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Начало");
	//	
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Начало");
	//	
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Начало");
	//	
	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Конец");
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Конец");
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Конец");
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Конец");
КонецПроцедуры
