
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = РегистрыСведений.НастройкиСистемы.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		Характеристика	 = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Значение		 = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		   
		Если Характеристика = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				НоменклатураБТ = Справочники.НоменклатураБТ.ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
				Если НЕ (НоменклатураБТ.ПолучитьОбъект() = Неопределено) Тогда
					МЗ = РегистрыСведений.НастройкиСистемы.СоздатьМенеджерЗаписи();
					МЗ.Характеристика = ПланыВидовХарактеристик.НаборХарактеристикСистемный[Характеристика];
					МЗ.Значение = НоменклатураБТ;
					МЗ.Записать(Истина);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции
