
Процедура ОбновитьДанныеСправочника(ЕстьИзменения = Ложь, ЕстьУдаленные = Ложь, ТолькоПроверка = Ложь) Экспорт
	
	
	Группа = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Документы", Истина);
	Если НЕ ЗначениеЗаполнено(Группа) Тогда
		Группа = Справочники.ИдентификаторыОбъектовМетаданных.СоздатьЭлемент();
		Группа.Наименование = "Документы";
		Группа.Записать();
	КонецЕсли;
	
	Для Каждого ЭлементМД ИЗ Метаданные.Документы Цикл
		
		ПолноеИмя = ЭлементМД.ПолноеИмя();
		Синоним = ЭлементМД.Синоним;
		
		ЭлементСправочника = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ПолноеИмя);
		Если НЕ ЗначениеЗаполнено(ЭлементСправочника) Тогда
			//
			ЭлементСправочникаОбъект = Справочники.ИдентификаторыОбъектовМетаданных.СоздатьЭлемент();
			ЭлементСправочникаОбъект.Наименование = Синоним;
			ЭлементСправочникаОбъект.ПолноеИмя = ПолноеИмя;
			ЭлементСправочникаОбъект.Родитель = Группа;
			ЭлементСправочникаОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	
	Группа = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Справочники", Истина);
	Если НЕ ЗначениеЗаполнено(Группа) Тогда
		Группа = Справочники.ИдентификаторыОбъектовМетаданных.СоздатьЭлемент();
		Группа.Наименование = "Справочники";
		Группа.Записать();
	КонецЕсли;
	
	Для Каждого ЭлементМД ИЗ Метаданные.Справочники Цикл
		
		ПолноеИмя = ЭлементМД.ПолноеИмя();
		Синоним = ЭлементМД.Синоним;
		
		ЭлементСправочника = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ПолноеИмя);
		Если НЕ ЗначениеЗаполнено(ЭлементСправочника) Тогда
			//
			ЭлементСправочникаОбъект = Справочники.ИдентификаторыОбъектовМетаданных.СоздатьЭлемент();
			ЭлементСправочникаОбъект.Наименование = Синоним;
			ЭлементСправочникаОбъект.ПолноеИмя = ПолноеИмя;
			ЭлементСправочникаОбъект.Родитель = Группа;
			ЭлементСправочникаОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры