

&НаСервере
Функция ПолучитьСхему()
	
	ИмяФайла = ПолучитьИмяВременногоФайла("json");
	Схема.Записать(ИмяФайла);
	Стр = Новый ДвоичныеДанные(ИмяФайла);	
	УдалитьФайлы(ИмяФайла);
	
	//ОбъектXDTO = СериализаторXDTO.ЗаписатьXDTO(Схема);
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.УстановитьСтроку();
	//ФабрикаXDTO.ЗаписатьJSON(ЗаписьJSON, ОбъектXDTO);
	//Стр = ЗаписьJSON.Закрыть(); 
	
	Возврат Стр;
	
КонецФункции

&НаКлиенте
Процедура СохранитьИВыйти(Команда)
	
	Результат = Новый Структура("Схема");
	Результат.Схема = ПолучитьСхему();
	
	Закрыть(Результат);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаЖСОН = "";	
	ЭтаФорма.Параметры.Свойство("Схема", СхемаЖСОН);
	
	Если ЗначениеЗаполнено(СхемаЖСОН) Тогда
		
		ИмяФайла = ПолучитьИмяВременногоФайла("json");
		СхемаЖСОН.Записать(ИмяФайла);
		Схема.Прочитать(ИмяФайла);
		УдалитьФайлы(ИмяФайла);
		
		//НЕ РАБОТАЕТ XDTO Приходиться извращаться через двоичныеданные
		//ЧтениеJSON = Новый ЧтениеJSON; 
		//ЧтениеJSON.УстановитьСтроку(СхемаЖСОН);
		//ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.3/data/graphscheme", "FlowchartContextType");
		//ОбъектXDTO = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON,ТипОбъектаXDTO); 
		//ОбъектXDTO.Проверить();
		//
		//Схема = СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);
							
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолеСхемыВыбор(Элемент)
	
	Если Элемент.ТекущийЭлемент <> Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущийЭлемент) = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния") ИЛИ
			ТипЗнч(Элемент.ТекущийЭлемент) = Тип("ЭлементГрафическойСхемыДекоративнаяЛиния") ИЛИ
			ТипЗнч(Элемент.ТекущийЭлемент) = Тип("ЭлементГрафическойСхемыДекорация") Тогда
		Иначе
			
			//Сообщить(Элемент.ТекущийЭлемент);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеСхемыПриИзменении(Элемент)
	
	Если Элемент.ТекущийЭлемент <> Неопределено Тогда
		Если ТипЗнч(Элемент.ТекущийЭлемент) = Тип("ЭлементГрафическойСхемыСоединительнаяЛиния") ИЛИ
			ТипЗнч(Элемент.ТекущийЭлемент) = Тип("ЭлементГрафическойСхемыДекоративнаяЛиния") ИЛИ
			ТипЗнч(Элемент.ТекущийЭлемент) = Тип("ЭлементГрафическойСхемыДекорация") Тогда
		Иначе
			
			//НоваяСтрока = ЭлементыСхемы.Добавить();
			//НоваяСтрока.Элемент = Элемент.ТекущийЭлемент.Имя;
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
