
&НаСервере
Процедура ЗарегестрироватьПодпискиНаЗагрузкуНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиЗагрузокУслуг.Ссылка КАК Ссылка,
	               |	НастройкиЗагрузокУслуг.RESTЗапрос КАК RESTЗапрос,
	               |	НастройкиЗагрузокУслуг.СерверШины КАК СерверШины
	               |ИЗ
	               |	Справочник.НастройкиЗагрузокУслуг КАК НастройкиЗагрузокУслуг
	               |ГДЕ
	               |	НастройкиЗагрузокУслуг.Использовать = ИСТИНА";	
	Выгрузка = Запрос.Выполнить().Выбрать();
	Пока Выгрузка.Следующий() Цикл
		Результат = УправлениеБТСервер.ЗарегистрироватьПодпискуНаЗагрузкуВШине(Выгрузка.СерверШины, НРег(Выгрузка.RESTЗапрос));
		Если Результат Тогда
			Сообщить("Установлена подписка на Выгрузку: " + Выгрузка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегестрироватьПодпискиНаЗагрузку(Команда)
	ЗарегестрироватьПодпискиНаЗагрузкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура СнятьСРегистрацииПодпискиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиЗагрузокУслуг.Ссылка КАК Ссылка,
	               |	НастройкиЗагрузокУслуг.RESTЗапрос КАК RESTЗапрос,
	               |	НастройкиЗагрузокУслуг.СерверШины КАК СерверШины
	               |ИЗ
	               |	Справочник.НастройкиЗагрузокУслуг КАК НастройкиЗагрузокУслуг
	               |ГДЕ
	               |	НастройкиЗагрузокУслуг.Использовать = ИСТИНА";	
	Выгрузка = Запрос.Выполнить().Выбрать();
	Пока Выгрузка.Следующий() Цикл
		Результат = УправлениеБТСервер.УдалитьПодпискуЗагрузкиВШине(Выгрузка.СерверШины, НРег(Выгрузка.RESTЗапрос));
		Если Результат Тогда
			Сообщить("Удалена подписка на Выгрузку: " + Выгрузка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьСРегистрацииПодписки(Команда)
	СнятьСРегистрацииПодпискиНаСервере();
КонецПроцедуры
